public/man/man1/nix3-store.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - nix3-store.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - nix3-store.1</h1>
    
<p><strong>Warning</strong><br>
This program is <strong>experimental</strong> and its interface is subject to change.</p>
<p>#+end_quote</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Name
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p><code class="verbatim">nix store</code> - manipulate a Nix store</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Synopsis
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><code class="verbatim">nix store</code> [/option/…] <em>subcommand</em></p>
<p>
where <em>subcommand</em> is one of the following:</p>
<ul>
<li><code class="verbatim">nix store add</code> - Add a file or directory to the Nix store</li>
<li><code class="verbatim">nix store add-file</code> - Deprecated. Use <code class="verbatim">nix store add --mode flat</code>
instead.</li>
<li><code class="verbatim">nix store add-path</code> - Deprecated alias to <code class="verbatim">nix store add</code>.</li>
<li><code class="verbatim">nix store cat</code> - print the contents of a file in the Nix store on
stdout</li>
<li><code class="verbatim">nix store copy-log</code> - copy build logs between Nix stores</li>
<li><code class="verbatim">nix store copy-sigs</code> - copy store path signatures from substituters</li>
<li><code class="verbatim">nix store delete</code> - delete paths from the Nix store</li>
<li><code class="verbatim">nix store diff-closures</code> - show what packages and versions were added
and removed between two closures</li>
<li><code class="verbatim">nix store dump-path</code> - serialise a store path to stdout in NAR format</li>
<li><code class="verbatim">nix store gc</code> - perform garbage collection on a Nix store</li>
<li><code class="verbatim">nix store info</code> - test whether a store can be accessed</li>
<li><code class="verbatim">nix store ls</code> - show information about a path in the Nix store</li>
<li><code class="verbatim">nix store make-content-addressed</code> - rewrite a path or closure to
content-addressed form</li>
<li><code class="verbatim">nix store optimise</code> - replace identical files in the store by hard
links</li>
<li><code class="verbatim">nix store path-from-hash-part</code> - get a store path from its hash part</li>
<li><code class="verbatim">nix store ping</code> - test whether a store can be accessed</li>
<li><code class="verbatim">nix store prefetch-file</code> - download a file into the Nix store</li>
<li><code class="verbatim">nix store repair</code> - repair store paths</li>
<li><code class="verbatim">nix store sign</code> - sign store paths with a local key</li>
<li><code class="verbatim">nix store verify</code> - verify the integrity of store paths</li>
</ul>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Options
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Logging-related options
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<ul>
<li><code class="verbatim">--debug</code>

Set the logging verbosity level to ‘debug&#39;.</li>
<li><code class="verbatim">--log-format</code> <em>format</em>

Set the format of log output; one of <code class="verbatim">raw</code>, <code class="verbatim">internal-json</code>, <code class="verbatim">bar</code> or
<code class="verbatim">bar-with-logs</code>.</li>
<li><code class="verbatim">--print-build-logs</code> / <code class="verbatim">-L</code>

Print full build logs on standard error.</li>
<li><code class="verbatim">--quiet</code>

Decrease the logging verbosity level.</li>
<li><code class="verbatim">--verbose</code> / <code class="verbatim">-v</code>

Increase the logging verbosity level.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Miscellaneous global options
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<ul>
<li><code class="verbatim">--help</code>

Show usage information.</li>
<li><code class="verbatim">--offline</code>

Disable substituters and consider all previously downloaded files
up-to-date.</li>
<li><code class="verbatim">--option</code> <em>name</em> <em>value</em>

Set the Nix configuration setting <em>name</em> to <em>value</em> (overriding
<code class="verbatim">nix.conf</code>).</li>
<li><code class="verbatim">--refresh</code>

Consider all previously downloaded files out-of-date.</li>
<li><code class="verbatim">--version</code>

Show version information.

<strong>Note</strong>

See <code class="verbatim">man nix.conf</code> for overriding configuration settings with command
line flags.</li>
</ul>
</div>
</div>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
